normalizing_dictionary = {
    ('ك'): 'ک',
    ('ي'): 'ی',
    ('ؤ'): 'ی',

    ('اُ', 'اِ', 'اَ', 'اّ'): 'ا',
    ('بُ', 'بِ', 'بَ', 'بّ'): 'ب',
    ('پُ', 'پِ', 'پَ', 'پّ'): 'پ',
    ('تُ', 'تِ', 'تَ', 'تّ'): 'ت',
    # ('','','',''):'',
    # ('','','',''):'',
    # ('','','',''):'',
    # ('','','',''):'',
    # ('','','',''):'',
    # ('','','',''):'',
    # ('','','',''):'',
    # ('','','',''):'',
    # ('','','',''):'',
    # ('','','',''):'',
    # ('','','',''):'',
    # ('','','',''):'',
    # ('','','',''):'',
    # ('','','',''):'',
    # ('','','',''):'',
    # ('','','',''):'',
    # ('','','',''):'',
    # ('','','',''):'',
    # ('','','',''):'',
    # ('','','',''):'',
    ('رَ', 'رّ', 'رِ', 'رُ'): 'ر',

    ('یُ', 'یِ', 'یَ', 'یّ'): 'ی',
}

tokenizing_dictionary = {  # for a single tuple use a comma to avoid unwanted casting. e.g. ('می سی سی پی', )
    ('می سی سی پی',): 'می‌سی‌سی‌پی',  # fixes می سی سی پی
    ('گفت و گو', 'گفتگو'): 'گفت‌و‌گو',
    ('بنیان گذار',): 'بنیان‌گذار',
    ('سیستان و بلوچستان',): 'سیستان‌و‌بلوچستان',
    # 'درون گرا':'درونگرا',
    # 'کلاه برداری':'کلاهبرداری',
    # 'آیین نامه':'آیین‌نامه',
    # 'بین المللی':'بین‌الملل',
    # 'دست یابی':'دست‌یابی',
    # 'عقب نشینی':'عقب‌نشینی',
    # ('منحصربفرد','منحصر بفرد','منحصر به فرد'):'منحصربه‌فرد',
    # ('علی ایها الحال','علی ای حال','علی‌ای حال'):'علی‌ای‌حال',
    # 'نخست وزیر':'نخست‌وزیر',
    # 'طاقت فرسا':'طاقت‌فرسا',
    # 'حمل و نقل':'حمل‌ونقل',
    # 'بین المللی':'بین‌المللی',
    # 'علی الخصوص':'علی‌الخصوص',
    # 'پیش بینی':'پیش‌بینی',
    # 'جست و جو':'جست‌وجو',
    # 'آیت الله':'آیت‌الله',
    # 'حجت الاسلام':'حجت‌الاسلام',
    # 'حجت الاسلام و المسلمین':'حجت‌الاسلام‌والمسلمین',
    # 'آیت الله العظمی':'آیت‌الله‌العظمی',
    # 'فی مابین':'فی‌ما‌بین',
    # 'چنان چه':'چنان‌چه',
    # 'بنابر این':'بنابراین',
    # 'مع ذلک':'مع‌ذلک',
}

verbs = {
    (' می ',): ' می‌',  # no problem with آکادمی
    (' ام ', ' ام.', ' ام،', ' ام:'): '‌‌ام ',  # dot, comma, and ... will be eliminated as stop words.
    (' ای ', ' ای.', ' ای،', ' ای:'): '‌‌ای ',
    (' ایم ', ' ایم.', ' ایم،', ' ایم:'): '‌‌ایم ',
    (' اید ', ' اید.', ' اید،', ' اید:'): '‌‌اید ',
    (' اند ', ' اند.', ' اند،', ' اند:'): 'اند ',

}

casefolding = {
    'اطاق': 'اتاق',
    'آیینه': 'آینه',
    'هیات': 'هیئت',
    'طوسی': 'توسی',
    'بلیط': 'بلیت',
    'ذغال': 'زغال',
    'اسطبل': 'اصطبل',
    'تزئين': 'تزیین',
    'هيجده': 'هجده',
    'باطلاق': 'باتلاق',
    'آذوقه': 'آزوقه',
    'تآتر': 'تئاتر',
    'غلطيدن': 'غلتيدن',
    'باطری': 'باتری',
    'باجناغ': 'باجناق',
    'غورباقه': 'قورباغه',
    'طهران': 'تهران',
    'پرهیزکار': 'پرهیزگار',
    'دکتری': 'دکترا',
    'کسری': 'کسرا',
    'شوری': 'شورا',
    'سیبیل': 'سبیل',
    'شیلنگ': 'شلنگ',
    'گهر': 'گوهر',
    'خوشنود': 'خشنود',
    'چاووش': 'چاوش',
    'داوود': 'داود',
    'انظباط': 'انضباط',
    'امپراطور': 'امپراتور',
    'طاس‌کباب': 'تاس‌کباب',
    'چلقوز': 'چلغوز',
    'قورمه': 'قرمه',
    'لاطاری': 'لاتاری',
    # '':'',
}

abbreviations = {
    'ج.ا.': 'جمهوری اسلامی',
    'آ.د.ک': 'آیین دادرسی کیفری',
    'آبفا': 'آب‌و‌فاضلاب',
    'آپ': 'آسان پرداخت',
    'اتکا': 'اداره تدارکات کادر ارتش',
    # '':'',
    # http://www.mokhafaf.com/word/%DA%A9%D9%84%D9%85%D8%A7%D8%AA-%D9%81%D8%A7%D8%B1%D8%B3%D9%8A/
    # https://article.tebyan.net/281258/%D8%A7%D8%AE%D8%AA%D8%B5%D8%A7%D8%B1%D8%A7%D8%AA-%D9%88-%D8%A2%D8%BA%D8%A7%D8%B2%D9%87-%D9%87%D8%A7-%D8%AF%D8%B1-%D8%B2%D8%A8%D8%A7%D9%86-%D9%81%D8%A7%D8%B1%D8%B3%DB%8C
}

'''
plurals = {
    'آداب':'ادب',
    'اطراف':'طرف',
    'حقایق':'حقیقت',
    'امواج':'موج',
    # 'ادبا	ادیب
    # 'اعماق	عمق
    # 'خزائن	خزینه
    # 'مراکز	مرکز
    # 'آثار	اثر
    # 'علما	عالم
    # 'اخبار	خبر
    # 'مواقع	موقع
    # اسرا	سر
    # علوم	علم
    # ادوار	دور
    # مصارف	مصرف
    # اسامی	اسم
    # علائم	علامت
    # ادیان	دین
    # معارف	معرفت
    # اساطیر	اسطوره
    # علل		علت
    # دفاتر	دفتر
    # مباحث	مبحث
    # امرا	امیر
    # عقائد	عقیده
    # ذخایر	ذخیره
    # مواد	ماده
    # اوامر	امور
    # اعمال	عمل
    # رفقا	رفیق
    # مذاهب	مذهب
    # ائمه	امام
    # اعیاد	عید
    # آرا		رای
    # مصائب	مصیبت
    # اصول	اصل
    # عناصر	عنصر
    # رسوم	رسم
    # معابد	معبد
    # آفاق	افق
    # عواطف	عاطفه
    # روابط	رابطه
    # مساجد	مسجد
    # ابیات	بیت
    # اعضا	عضو
    # رموز	رمز
    # معابر	معبر
    # تجار		تاجر
    # عبارات	عبارت
    # رجال	رجل
    # مظاهر	مظهر
    # تصاویر	تصویر
    # عجایب	عجیبه
    # ارقام	رقم
    # اجداد	جد
    # فقها	فقیه
    # زوایا	زاویه
    # امراض	مرض
    # جوانب	جانب
    # فنون	فن
    # زعما	زعیم
    # موارد	موزد
    # جزایر	جزیره
    # افکار	فکر
    # سوانح	سانحه
    # مراحل	مرحله
    # جبال	جبل
    # فرایض	فریضه
    # سلاطین	سلطان
    # مفاهیم	مفهوم
    # جرایم	جریمه
    # افعال	فعل
    # اشعار	شعر
    # منابع	منبع
    # حوادث	حادثه
    # فقرا	فقیر
    # شعرا	شاعر
    # اماکن	مکان
    # احشام	حشم
    # قواعد	قاعده
    # آثار	اثر
    # احوال 	حال
    # اخلاق 	خلق
    # ارکان 	رکن
    # اسرار 	سر
    # اشیا 	شی
    # اصول 	اصل
    # اعضا 	عضو
    # افراد  	فرد
    # افکار 	فکر
    # اقوام	قوم
    # اوقات 	وقت
    # تصاویر 	تصویر
    # تعالیم 	تعلیم
    # تماثیل 	تمثیل
    # حقوق 	حق
    # حواس 	حس
    # خاطرات 	خاطره
    # خرافات	خارفه
    # دلایل 	دلیل
    # شمایل 	شمیله
    # عناصر 	عنصر
    # عوامل	عامل
    # فضایل 	فضیلت
    # کلمات  	کلمه
    # مجالس 	مجلس
    # مطالب 	مطلب
    # مظاهر  	مظهره
    # مفاهیم 	مفهوم
    # منابع 	منبع
    # نشریات	نشریه
    # نیّات  	نیت
    # وظایف 	وظیفه
    # فلاسفه	فلاس
    # مذاکرات	مذاکره
    # معاملات	معامله
    # ادارات	اداره
    # ضربات	ضربه
    # حملات	حمله
    # جزِئیات	جزء
    # دخانیات	دخان
    # شایعات	شایعه
    # عنایات	عنایت
    # اموال	مال
} 
'''
